{"pageProps":{"post":{"live":true,"readingTime":"8 min read","title":"An Opinionated Coding Styleguide for Angular","date":"2020-03-09T00:00:00.322Z","slug":"opinionated-coding-styleguide-for-angular","coverImage":"https://cdn-images-1.medium.com/max/2560/1*gJ7d3BUj4rJDA4ZEdLRNSA.jpeg","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"An internal style guide for writing code is an important decision that any development team should define and agree on at some point, ideally early on in the project.","content":"\nThis post was originally published, by myself, on the [Bit](https://blog.bitsrc.io) blog\n\nAn internal style guide for writing code is an important decision that any development team should define and agree on at some point, ideally early on in the project.\n\nIf you’ve been writing code professionally, you know very well how important style is for many, many developers. Countless hours in my career have been spent arguing about style.\n\nWhy is it so important, though? **Programmers read code way more than they write**: it’s crucial that we simplify this task as much as possible for us but especially for our fellow teammates.\n\nThe consensus is to define a style guide before writing the first line of code, but this should not be fixed for the entire project lifecycle: **it is a continuous set of learnings deriving from experimentation and experience.**\n\nIt also doesn’t mean you should change your mind every day: it means you should evaluate, discuss and decide with your team as your project grows.\n\nAfter writing Angular apps since the alpha days, I’ve developed my style, strongly influenced by people I’ve worked with, reading lots of people’s code, and simply experimenting with my projects.\n\nIn this article, I want to show how I style my Angular apps and the rationale behind my decisions. Hopefully, it will inspire you and your team to adopt some of it or to make your own.\n\nAny suggestions would be extremely welcome on how to improve it!\n\n**Notice**: this style guide is purely stylistic not based on technical details and best practices. This style guide is intended to **simply help with code aesthetics and readability**, not performance, design patterns or else.\n\n## HTML Wrapping and Order\n\nAngular templates have quite a few syntax additions on top of normal HTML, and sometimes they’re not very easy to read.\n\nMy first suggestion regards the wrapping. I normally **do not exceed 80 characters per column** for all files: it’s simply much easier to read vertically than horizontally.\n\nThis is an element written without any convention:\n\n![](https://cdn-images-1.medium.com/max/4096/1*OSGrVXJZrUKE0kragUxzkA.png)\n\nMessy, isn’t it? Almost every project I’ve worked on while consulting was written in a similar fashion.\n\nWe’re going to rewrite the snippet above using a set of simple rules to make it way more readable.\n\n### Defining Rules For Writing HTML Tags\n\n* When an element has two or more attributes, I normally **only write one attribute per line**\n\n* Attributes have to be written **in a specific order**\n\n* Unless using a single attribute, the closing tag has to be written **on the next line**\n\n![](https://cdn-images-1.medium.com/max/2000/1*fdCeXlyeroegvXDL4t6Q3A.png)\n\nI suggest defining a specific order:\n\n* 1. Structural directives\n\n* 2. Animations\n\n* 3. Static properties\n\n* 4. Dynamic properties\n\n* 5. Events\n\nLet’s see an example of how I would personally write the previous example:\n\n![](https://cdn-images-1.medium.com/max/2888/1*FW_aK1ASTl3GCtacJ0WdkQ.png)\n\nEven better, I’d always use structural directives exclusively with ng-container:\n\n![](https://cdn-images-1.medium.com/max/2888/1*uxEVM22JmR2JeR4RKyKRng.png)\n\nWhile I think you can mix up the order of the attributes based on a subjective view, I feel quite strong about **displaying structural directives before anything else**.\n\nA structural directive tells me (before I need to know anything else it does):\n\n* Is this field being shown? And why?\n\n* Is this field being repeated?\n\nIn my opinion, this can facilitate reading through and understanding the structure of your templates.\n\n## Pipes\n\nPipes are very powerful: they can transform the values in templates and avoid duplication/logic in our components. They can be reused and mixed easily, and are easy to write.\n\nBut are they easy to read and to spot? Yes and No.\n\nThis is highly subjective and a minor point but I still think it can be valuable to share: whenever I see a pipe in my template, I tend to wrap them within parenthesis. The feeling of division provided by the parenthesis gives me a clue that the value is being transformed and generally is easier on the eye:\n\n![](https://cdn-images-1.medium.com/max/2000/1*Bi5BVprv9s_wCnBAq0ublA.png)\n\nWhen using multiple pipes, it may even be more important:\n\n![](https://cdn-images-1.medium.com/max/2000/1*WJsTeLNok5M7flf7dMHE2w.png)\n\n## Lifecycle Hooks\n\n### Interfaces\n\nAdding lifecycle hooks interfaces is not mandatory but a suggested practice, which I strongly recommend to follow.\n\n### Order\n\nWhen I look for lifecycle hooks, I usually head to the constructor and expect them to see all of them together and not mixed up with other class methods. Ideally, they should be defined in the same order they execute.\n\nWhat I recommend is:\n\n* always add interfaces\n\n* add public and private properties above the constructor\n\n* add methods right below the constructor and above the component’s methods\n\n* add them all close to each other\n\n* add them in the order they execute. Admittedly though, this is a bit harder to follow consistently, so I guess it’s the least important one\n\n![](https://cdn-images-1.medium.com/max/2492/1*TgTzECqW7WzMBvpm0x0mIA.png)\n\n### Logic\n\nI normally avoid directly writing any logic within the lifecycle hooks: my suggestion is to encapsulate logic within private methods and call them within the lifecycle hooks:\n\n![](https://cdn-images-1.medium.com/max/2000/1*v06_dzz_36OiXdddKufhvw.png)\n\n## Component Properties and Methods\n\nAngular uses decorators for the component’s methods and properties in order to augment its functionality.\n\nThere are so many of them that defining a specific order to follow would be overwhelming, but the important thing I try to follow is to locate the properties and methods with the same decorator close to each other.\n\nThe following is what I would consider a bad example:\n\n![](https://cdn-images-1.medium.com/max/2316/1*1O2RFk_3068CwfotLAmFSA.png)\n\nAnd below is how I would write it; also, notice there’s an empty line in between groups of properties with the same decorator — I think it helps with readability:\n\n![](https://cdn-images-1.medium.com/max/2316/1*uWXSp-qhoZY5n_Cdk6bQ-w.png)\n\nI don’t have a strong opinion on this, but try to locate private and public component properties not marked with any decorator separately from the decorated properties.\n\nIn my experience, mixing them up only leads to confusion and a feeling of chaos.\n\n## Naming\n\nOh, naming things is hard, I know.\n\nWhen it comes to naming, I always have to think it twice or more to come up with a name that is understandable, unambiguous and easy-to-search:\n\n* *understandable*: what does this do, at a glance?\n\n* *unambiguous*: for example, if we have multiple click events on a single component, which one does this event refer to? So yeah, naming it *onClick* is **not** the way to go\n\n* *easy-to-search*: I see naming code a bit like SEO: how will my users (teammates or me) search for this particular thing — and how can I write it to make sure they can search for it more easily?\n\n### File Names\n\nI like to use hyphen-case for all file names. I would think by now it’s a standard for Typescript projects, but I’ve seen quite a few variations, even in Angular projects, so I feel I have to mention this.\n\nExamples:\n\n* sign-up.component.ts\n\n* profile-form.component.html\n\n### Route Components\n\nI tend to name route components with a suffix page.\n\nFor example, the authentication page would normally be called auth-page.component.ts — which tells me it’s a routed component, and I normally use it to wrap and display other components via router-outlet.\n\n### Components\n\nSome rules I tend to follow when naming components are:\n\n* Try to use **no more than 3 words** (excluding the prefix). No specific reason why — they just don’t look very pretty. Of course, sometimes it’s simply not very easy to respect this rule\n\n* Try to **avoid repeating words or contexts already used** with other components, as it would slow down while using the search function of my IDE, and also lead to mistakenly open other files, which is ultimately a waste of time and source of frustration\n\n* At the same time, **also try not to be too generic**. For example: if we call a component settings — settings of what!? Help out a little here and give some further context (example: application-settings, profile-settings, organization-settings, etc.). \nNo biggie for small applications, but at scale, it does make a difference\n\n### Events Names\n\nIt seems simple and yet it’s not, especially with larger components with many events.\n\nHere are a set of rules I try to follow:\n\n* Do not prefix events/outputs names with on. The handler, instead, could be written with such prefix\n\n* Don’t make me think: always specify the entity whose action referred, not only the action itself. \nIf we are describing an event on a component whose value changed, the event change could be valueChange.\nIn my opinion, this is unambiguous and tells me what changed without having me question if this was the value, the status, or anything else\n\n* Use past-sense or not (valueChange vs valueChanged)? This is controversial and I heard valid reasons on opposite sides, so it may be up for discussion for your and your team. \nAs long as you agree on one single-way, I don’t think it’s *that* important. What do you think?\n\n## ES Imports\n\nKeeping your file imports ordered and neat is challenging, especially when using an IDE to auto-add them as you type. As your files grow, they tend to get quite messy.\n\nThis how I order my imports:\n\n* 1. Angular imports always go at the top\n\n* 2. Rx imports\n\n* 3. Third parties (non-core)\n\n* 4. Local/Project imports at the end\n\nIt’s also a good practice to leave a comment above each group:\n\n![](https://cdn-images-1.medium.com/max/2596/1*cXI7qASNN8LUNUr4RUlcOg.png)\n\n### Opinionated Angular Repository\n\nI added a Github Repository called [Opinionated Angular](https://github.com/Gbuomprisco/opinionated-angular) where I’ll be dumping more of my thoughts for writing readable and beautiful Angular code.\n\nPlease come and contribute if you wish!\n\n## Takeaways ⭐\n\n* Wrap HTML elements neatly: place 1 single attribute per line, and sort attributes ordered by type\n\n* Use parenthesis around values that use pipes\n\n* Place lifecycle hooks next to each other and order them by order of execution\n\n* When naming things, ask yourself: is this understandable, unambiguous and easy-to-search?\n\n* Keep ES imports neat and ordered\n\nI would love to receive some tips and learn about your conventions and rules you and your team follow. Alternatively, if you need any clarifications, or if you think something is unclear or wrong, do please leave a comment!\n","canonical":"https://blog.bitsrc.io/an-opinionated-styleguide-for-angular-af623d54e2b8","tags":["angular"]},"content":{"compiledSource":"var h=Object.defineProperty,u=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var l=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var s=(t,a,i)=>a in t?h(t,a,{enumerable:!0,configurable:!0,writable:!0,value:i}):t[a]=i,e=(t,a)=>{for(var i in a||(a={}))l.call(a,i)&&s(t,i,a[i]);if(o)for(var i of o(a))r.call(a,i)&&s(t,i,a[i]);return t},p=(t,a)=>u(t,d(a));var m=(t,a)=>{var i={};for(var n in t)l.call(t,n)&&a.indexOf(n)<0&&(i[n]=t[n]);if(t!=null&&o)for(var n of o(t))a.indexOf(n)<0&&r.call(t,n)&&(i[n]=t[n]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var n=i,{components:t}=n,a=m(n,[\"components\"]);return mdx(MDXLayout,p(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"This post was originally published, by myself, on the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://blog.bitsrc.io\"}),\"Bit\"),\" blog\"),mdx(\"p\",null,\"An internal style guide for writing code is an important decision that any development team should define and agree on at some point, ideally early on in the project.\"),mdx(\"p\",null,\"If you\\u2019ve been writing code professionally, you know very well how important style is for many, many developers. Countless hours in my career have been spent arguing about style.\"),mdx(\"p\",null,\"Why is it so important, though? \",mdx(\"strong\",{parentName:\"p\"},\"Programmers read code way more than they write\"),\": it\\u2019s crucial that we simplify this task as much as possible for us but especially for our fellow teammates.\"),mdx(\"p\",null,\"The consensus is to define a style guide before writing the first line of code, but this should not be fixed for the entire project lifecycle: \",mdx(\"strong\",{parentName:\"p\"},\"it is a continuous set of learnings deriving from experimentation and experience.\")),mdx(\"p\",null,\"It also doesn\\u2019t mean you should change your mind every day: it means you should evaluate, discuss and decide with your team as your project grows.\"),mdx(\"p\",null,\"After writing Angular apps since the alpha days, I\\u2019ve developed my style, strongly influenced by people I\\u2019ve worked with, reading lots of people\\u2019s code, and simply experimenting with my projects.\"),mdx(\"p\",null,\"In this article, I want to show how I style my Angular apps and the rationale behind my decisions. Hopefully, it will inspire you and your team to adopt some of it or to make your own.\"),mdx(\"p\",null,\"Any suggestions would be extremely welcome on how to improve it!\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Notice\"),\": this style guide is purely stylistic not based on technical details and best practices. This style guide is intended to \",mdx(\"strong\",{parentName:\"p\"},\"simply help with code aesthetics and readability\"),\", not performance, design patterns or else.\"),mdx(\"h2\",null,\"HTML Wrapping and Order\"),mdx(\"p\",null,\"Angular templates have quite a few syntax additions on top of normal HTML, and sometimes they\\u2019re not very easy to read.\"),mdx(\"p\",null,\"My first suggestion regards the wrapping. I normally \",mdx(\"strong\",{parentName:\"p\"},\"do not exceed 80 characters per column\"),\" for all files: it\\u2019s simply much easier to read vertically than horizontally.\"),mdx(\"p\",null,\"This is an element written without any convention:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4096/1*OSGrVXJZrUKE0kragUxzkA.png\",alt:null}))),mdx(\"p\",null,\"Messy, isn\\u2019t it? Almost every project I\\u2019ve worked on while consulting was written in a similar fashion.\"),mdx(\"p\",null,\"We\\u2019re going to rewrite the snippet above using a set of simple rules to make it way more readable.\"),mdx(\"h3\",null,\"Defining Rules For Writing HTML Tags\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"When an element has two or more attributes, I normally \",mdx(\"strong\",{parentName:\"p\"},\"only write one attribute per line\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Attributes have to be written \",mdx(\"strong\",{parentName:\"p\"},\"in a specific order\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Unless using a single attribute, the closing tag has to be written \",mdx(\"strong\",{parentName:\"p\"},\"on the next line\")))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2000/1*fdCeXlyeroegvXDL4t6Q3A.png\",alt:null}))),mdx(\"p\",null,\"I suggest defining a specific order:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ol\"},\"Structural directives\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"Animations\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:3}),mdx(\"li\",{parentName:\"ol\"},\"Static properties\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:4}),mdx(\"li\",{parentName:\"ol\"},\"Dynamic properties\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:5}),mdx(\"li\",{parentName:\"ol\"},\"Events\")))),mdx(\"p\",null,\"Let\\u2019s see an example of how I would personally write the previous example:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2888/1*FW_aK1ASTl3GCtacJ0WdkQ.png\",alt:null}))),mdx(\"p\",null,\"Even better, I\\u2019d always use structural directives exclusively with ng-container:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2888/1*uxEVM22JmR2JeR4RKyKRng.png\",alt:null}))),mdx(\"p\",null,\"While I think you can mix up the order of the attributes based on a subjective view, I feel quite strong about \",mdx(\"strong\",{parentName:\"p\"},\"displaying structural directives before anything else\"),\".\"),mdx(\"p\",null,\"A structural directive tells me (before I need to know anything else it does):\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Is this field being shown? And why?\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Is this field being repeated?\"))),mdx(\"p\",null,\"In my opinion, this can facilitate reading through and understanding the structure of your templates.\"),mdx(\"h2\",null,\"Pipes\"),mdx(\"p\",null,\"Pipes are very powerful: they can transform the values in templates and avoid duplication/logic in our components. They can be reused and mixed easily, and are easy to write.\"),mdx(\"p\",null,\"But are they easy to read and to spot? Yes and No.\"),mdx(\"p\",null,\"This is highly subjective and a minor point but I still think it can be valuable to share: whenever I see a pipe in my template, I tend to wrap them within parenthesis. The feeling of division provided by the parenthesis gives me a clue that the value is being transformed and generally is easier on the eye:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2000/1*Bi5BVprv9s_wCnBAq0ublA.png\",alt:null}))),mdx(\"p\",null,\"When using multiple pipes, it may even be more important:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2000/1*WJsTeLNok5M7flf7dMHE2w.png\",alt:null}))),mdx(\"h2\",null,\"Lifecycle Hooks\"),mdx(\"h3\",null,\"Interfaces\"),mdx(\"p\",null,\"Adding lifecycle hooks interfaces is not mandatory but a suggested practice, which I strongly recommend to follow.\"),mdx(\"h3\",null,\"Order\"),mdx(\"p\",null,\"When I look for lifecycle hooks, I usually head to the constructor and expect them to see all of them together and not mixed up with other class methods. Ideally, they should be defined in the same order they execute.\"),mdx(\"p\",null,\"What I recommend is:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"always add interfaces\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"add public and private properties above the constructor\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"add methods right below the constructor and above the component\\u2019s methods\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"add them all close to each other\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"add them in the order they execute. Admittedly though, this is a bit harder to follow consistently, so I guess it\\u2019s the least important one\"))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2492/1*TgTzECqW7WzMBvpm0x0mIA.png\",alt:null}))),mdx(\"h3\",null,\"Logic\"),mdx(\"p\",null,\"I normally avoid directly writing any logic within the lifecycle hooks: my suggestion is to encapsulate logic within private methods and call them within the lifecycle hooks:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2000/1*v06_dzz_36OiXdddKufhvw.png\",alt:null}))),mdx(\"h2\",null,\"Component Properties and Methods\"),mdx(\"p\",null,\"Angular uses decorators for the component\\u2019s methods and properties in order to augment its functionality.\"),mdx(\"p\",null,\"There are so many of them that defining a specific order to follow would be overwhelming, but the important thing I try to follow is to locate the properties and methods with the same decorator close to each other.\"),mdx(\"p\",null,\"The following is what I would consider a bad example:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2316/1*1O2RFk_3068CwfotLAmFSA.png\",alt:null}))),mdx(\"p\",null,\"And below is how I would write it; also, notice there\\u2019s an empty line in between groups of properties with the same decorator \\u2014 I think it helps with readability:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2316/1*uWXSp-qhoZY5n_Cdk6bQ-w.png\",alt:null}))),mdx(\"p\",null,\"I don\\u2019t have a strong opinion on this, but try to locate private and public component properties not marked with any decorator separately from the decorated properties.\"),mdx(\"p\",null,\"In my experience, mixing them up only leads to confusion and a feeling of chaos.\"),mdx(\"h2\",null,\"Naming\"),mdx(\"p\",null,\"Oh, naming things is hard, I know.\"),mdx(\"p\",null,\"When it comes to naming, I always have to think it twice or more to come up with a name that is understandable, unambiguous and easy-to-search:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"em\",{parentName:\"p\"},\"understandable\"),\": what does this do, at a glance?\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"em\",{parentName:\"p\"},\"unambiguous\"),\": for example, if we have multiple click events on a single component, which one does this event refer to? So yeah, naming it \",mdx(\"em\",{parentName:\"p\"},\"onClick\"),\" is \",mdx(\"strong\",{parentName:\"p\"},\"not\"),\" the way to go\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"em\",{parentName:\"p\"},\"easy-to-search\"),\": I see naming code a bit like SEO: how will my users (teammates or me) search for this particular thing \\u2014 and how can I write it to make sure they can search for it more easily?\"))),mdx(\"h3\",null,\"File Names\"),mdx(\"p\",null,\"I like to use hyphen-case for all file names. I would think by now it\\u2019s a standard for Typescript projects, but I\\u2019ve seen quite a few variations, even in Angular projects, so I feel I have to mention this.\"),mdx(\"p\",null,\"Examples:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"sign-up.component.ts\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"profile-form.component.html\"))),mdx(\"h3\",null,\"Route Components\"),mdx(\"p\",null,\"I tend to name route components with a suffix page.\"),mdx(\"p\",null,\"For example, the authentication page would normally be called auth-page.component.ts \\u2014 which tells me it\\u2019s a routed component, and I normally use it to wrap and display other components via router-outlet.\"),mdx(\"h3\",null,\"Components\"),mdx(\"p\",null,\"Some rules I tend to follow when naming components are:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Try to use \",mdx(\"strong\",{parentName:\"p\"},\"no more than 3 words\"),\" (excluding the prefix). No specific reason why \\u2014 they just don\\u2019t look very pretty. Of course, sometimes it\\u2019s simply not very easy to respect this rule\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Try to \",mdx(\"strong\",{parentName:\"p\"},\"avoid repeating words or contexts already used\"),\" with other components, as it would slow down while using the search function of my IDE, and also lead to mistakenly open other files, which is ultimately a waste of time and source of frustration\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"At the same time, \",mdx(\"strong\",{parentName:\"p\"},\"also try not to be too generic\"),`. For example: if we call a component settings \\u2014 settings of what!? Help out a little here and give some further context (example: application-settings, profile-settings, organization-settings, etc.).\nNo biggie for small applications, but at scale, it does make a difference`))),mdx(\"h3\",null,\"Events Names\"),mdx(\"p\",null,\"It seems simple and yet it\\u2019s not, especially with larger components with many events.\"),mdx(\"p\",null,\"Here are a set of rules I try to follow:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Do not prefix events/outputs names with on. The handler, instead, could be written with such prefix\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},`Don\\u2019t make me think: always specify the entity whose action referred, not only the action itself.\nIf we are describing an event on a component whose value changed, the event change could be valueChange.\nIn my opinion, this is unambiguous and tells me what changed without having me question if this was the value, the status, or anything else`)),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},`Use past-sense or not (valueChange vs valueChanged)? This is controversial and I heard valid reasons on opposite sides, so it may be up for discussion for your and your team.\nAs long as you agree on one single-way, I don\\u2019t think it\\u2019s `,mdx(\"em\",{parentName:\"p\"},\"that\"),\" important. What do you think?\"))),mdx(\"h2\",null,\"ES Imports\"),mdx(\"p\",null,\"Keeping your file imports ordered and neat is challenging, especially when using an IDE to auto-add them as you type. As your files grow, they tend to get quite messy.\"),mdx(\"p\",null,\"This how I order my imports:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ol\"},\"Angular imports always go at the top\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"Rx imports\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:3}),mdx(\"li\",{parentName:\"ol\"},\"Third parties (non-core)\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"ol\",e({parentName:\"li\"},{start:4}),mdx(\"li\",{parentName:\"ol\"},\"Local/Project imports at the end\")))),mdx(\"p\",null,\"It\\u2019s also a good practice to leave a comment above each group:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2596/1*cXI7qASNN8LUNUr4RUlcOg.png\",alt:null}))),mdx(\"h3\",null,\"Opinionated Angular Repository\"),mdx(\"p\",null,\"I added a Github Repository called \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/Gbuomprisco/opinionated-angular\"}),\"Opinionated Angular\"),\" where I\\u2019ll be dumping more of my thoughts for writing readable and beautiful Angular code.\"),mdx(\"p\",null,\"Please come and contribute if you wish!\"),mdx(\"h2\",null,\"Takeaways \\u2B50\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Wrap HTML elements neatly: place 1 single attribute per line, and sort attributes ordered by type\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Use parenthesis around values that use pipes\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Place lifecycle hooks next to each other and order them by order of execution\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"When naming things, ask yourself: is this understandable, unambiguous and easy-to-search?\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Keep ES imports neat and ordered\"))),mdx(\"p\",null,\"I would love to receive some tips and learn about your conventions and rules you and your team follow. Alternatively, if you need any clarifications, or if you think something is unclear or wrong, do please leave a comment!\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"series":[],"morePosts":[],"moreArticles":[{"live":true,"readingTime":"2 min read","title":"Benchmarking Angular 12 with Webpack 5","date":"2021-05-14T00:00:00.322Z","slug":"webpack-5-angular12","coverImage":"/assets/images/posts/benchmarking-webpack-5.webp","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"Angular 12 has been released and with it the much awaited Webpack 5 upgrade. In this post I benchmarked the bundle-size and compilation speed against the previous version","tags":["angular"]},{"live":true,"readingTime":"5 min read","title":"Principles for creating libraries with Nx and Angular","date":"2021-02-07T00:00:00.322Z","slug":"how-to-organize-nx-modules-with-angular","coverImage":"/assets/images/posts/organize-nx-modules-ngrx.webp","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"Working with Nx may be confusing. This article explains how I create Nx libraries and the principles behind my motivations","tags":["nx","angular"]},{"live":true,"readingTime":"3 min read","title":"Where to put your Angular models?","date":"2020-08-03T00:00:00.322Z","slug":"angular-where-to-put-models","ogImage":{"url":"/assets/images/posts/where-put-angular-models.png"},"coverImage":"/assets/images/posts/where-put-angular-models.webp","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"Organizing entities and models in your Angular app may be hard. This article explains where to put your entities and what mistakes to watch out for","tags":["angular","architecture"]},{"live":true,"readingTime":"5 min read","title":"Using the Intersection Observer API with Angular","date":"2020-08-01T00:00:00.322Z","slug":"intersection-observer-with-angular","coverImage":"/assets/images/posts/intersection-observer.webp","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"This article shows how to build a directive with Angular that uses the Intersection Observer API to check when an element becomes visible on the page","tags":["angular","performance"]},{"live":true,"readingTime":"3 min read","title":"Setters vs ngOnChanges: which one is better?","date":"2020-07-30T00:00:00.322Z","slug":"setters-vs-ng-on-changes","coverImage":"/assets/images/posts/setters-vs-on-changes.webp","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"Listening to Input changes can be done in different ways. But which one should you use?","tags":["angular"]},{"live":true,"readingTime":"3 min read","title":"Async Rendering with a single Rx Operator","date":"2020-07-11T00:00:00.322Z","slug":"async-rendering-with-a-single-rx-operator","collection":{"name":"Angular","primaryColor":"#e23236","primaryColorLight":"#dd00316e","contrastColor":"#ffffff","logo":"/assets/images/collections/angular.webp","slug":"angular"},"excerpt":"Increase your app rendering performance with this simple Rx operator","tags":["angular","rxjs"]}],"type":1},"__N_SSG":true}