{"pageProps":{"post":{"live":true,"readingTime":"10 min read","title":"Debugging Javascript Like a Pro","date":"2019-09-16T00:00:00.000Z","slug":"debugging-javascript-like-a-pro","coverImage":"https://cdn-images-1.medium.com/max/12000/0*7UocdWX7aZYDkNtP","collection":{"name":"Javascript","primaryColor":"#f7e017","primaryColorLight":"#f7e0178c","contrastColor":"#121212","logo":"/assets/images/collections/javascript.webp"},"excerpt":"Discover the best debugging tools Chrome has to offer","content":"\nThis post was originally published, by myself, on the [Bit](https://blog.bitsrc.io) blog\n\nAre you one of those who are console logging your way to a solution when your code is not behaving the way you expect? If yes, read on.\n\nThis article aims to explain to you the most useful tools and techniques provided by the Chrome Dev Tools to debug your Javascript code **better and faster than ever before**.\n\nBy the end of this article, you’ll be able to debug your code better and faster than ever before.\n\nThis is a summary of what we’re going to go through:\n\n* setting breakpoints to debug code at a specific line\n\n* navigating the call stack\n\n* pausing/resuming the script execution\n\n* setting watch expressions\n\n* productivity tips and tricks for the Dev Tools\n\n\n### Debugging Runtime Code\n\nIf the cause you’re debugging your code is due to a bug or unexpected behavior, you’re likely interested in the “Sources” tab in the Dev Tools, which is the section we’re going to explore in depth through a set of various scenarios.\n\n![](https://cdn-images-1.medium.com/max/2886/1*o-K2FM8avaFY0MDonke7eQ.png)\n\n## Breakpoints\n\nIf you are reading this article, you probably are used to debugging a particular line by logging to the console a certain value. But I want you to introduce to a more powerful way that goes way deeper in the code than simply logging: **breakpoints**.\n\nSetting breakpoints is normally the first step of the debugging process. The built-in development tools in most browsers allow you to stop the execution of your code at a particular line of code and at a particular statement on every line of code running on the page being debugged, but for the purpose of this article, we will be specifically using the Chrome Dev Tools.\n\n### What are Breakpoints for?\n\nNormally, you may want to stop the execution of the code so that you can interactively inspect the particular context that we’re interested in.\n\nOnce the code has stopped at the breakpoint, we can start the debugging process by getting access to the scope, navigating the call stack, and even change the code at runtime.\n\n### How to set Breakpoints?\n\nIn order to explain how to set breakpoints, we will debug an Angular codebase of one of the side projects I use for education purposes, although the technology used doesn’t really matter.\n\n* The first thing you may want to do is to open the dev tools and go to the “Sources” tab\n\n* Then, we need to open the file we want to debug\n**Tip: **on Mac, ⌘ + O will open the files selector where you can find the file needed on the fly. On Windows, use CTRL+O\n\n* Once the file has been opened, we can finally set up a breakpoint by clicking on the line of code we want to stop on.\n\n![Setting a Breakpoint](https://cdn-images-1.medium.com/max/4316/1*HZnwrJpcjJQuBQuamXriIg.gif)\n\nAs you can see in the image above, we can go deeper than setting a breakpoint on a line of code, and we can also set it to the statements on the same line of code.\n\nWe set 3 breakpoints:\n\n* the first on the line of code that stops the execution at definition time\n\n* the second will stop before the priceReceived function executes\n\n* the third one will stop right after priceReceived gets called, so we can also inspect the return value of the arrow function\n\nWhen the arrow function gets called, the execution stops and the right-hand panel Scope gets populated with information regarding the current context, and gives us access to all the scope so we can inspect the values we’re interested in.\n\nIn this case, you can see how we can see the value of the variable price.\n\n![Analyzing the current scope](https://cdn-images-1.medium.com/max/4324/1*j56_-6hTF4z6pXWVC9TwnQ.png)\n\nIn the image below, our third breakpoint gets hit once the function priceReceived has been executed.\n\nAs you can see in the right-hand panel, Return value will show us what the anonymous function returns\n\n![Analyzing the Return Value of an anonymous function](https://cdn-images-1.medium.com/max/4334/1*skx3u3zsEm3-VF338jG2Xw.png)\n\n### Temporarily pausing Breakpoints\n\n**Scenario**: you set a bunch of breakpoints all over the codebase.\n\nAs you may have experienced, it’s very common to refresh the page multiple times while debugging.\n\nThe code you’re currently debugging may have various breakpoints and sometimes, these can even be called hundreds of times! Yeah, it can be frustrating and time-consuming.\n\nIn such cases, I recommend to temporarily pause the execution of all breakpoints, and you can do this by toggling the icon you can see in the image below:\n\n![Deactivating all Breakpoints](https://cdn-images-1.medium.com/max/3188/1*cnRKMhzmOptgjm0v6ey8-Q.gif)\n\n### Stopping Execution on Errors\n\n**Scenario**: you get an unexpected error, but you don’t want to set a breakpoint as you’re unsure when exactly the error is going to be thrown.\n\nYou can stop the execution as soon as an error is thrown, so you can inspect the scope and understand what went wrong.\n\n![Pausing on Exceptions](https://cdn-images-1.medium.com/max/4780/1*6B4Uvz3g4sZpqlnUWDEBpw.gif)\n\n### Conditional Breakpoints\n\nConditional Breakpoints, as the name suggests, allow us to only trigger certain breakpoints if a condition is truthy.\n\nFor instance, in the example shown above, the user can input in the text area non-numerical values. JS is very forgiving and will just display NaN instead of throwing an error.\n\n**Scenario**: you have more complex code than the one above, and can’t figure out when the result is NaN .\n\nOf course, you could set a breakpoint, but it’s not easy to reproduce the error and you end up spending half an hour stepping through the execution of your code. This is a scenario where you could use a conditional breakpoint and break the execution only when the value inspected is NaN .\n\nSee the image below:\n\n![Conditional Breakpoint](https://cdn-images-1.medium.com/max/4504/1*e-pc-wpZexL8tknq9wunLg.gif)\n\n* We right-click on the line of code we want to add the breakpoint to\n\n* Click on “Add conditional breakpoint…”\n\n* Add a valid JS expression. Of course, you have access to the scope when the expression gets called, which means we can reference the params x and y\n\n* When the expression is truthy, the breakpoint will be triggered!\n\n### Stepping through your code\n\nIn order to fully take advantage of the Dev Tools, it’s worth spending a little bit of time and learn how the Dev Tools helps us to quickly step through the code without setting breakpoints at each line.\n\n* **Step\n**The simplest navigator in the Dev Tools, allows you to step through your code line by line, based on execution order. \nIt’s important to notice that **Step **has been recently introduced due to a change to **Step Into next function call**. When debugging asynchronous code, *Step* will move to the next line chronologically\n\n![Step](https://cdn-images-1.medium.com/max/4504/1*lnLSkTfTPgoZnH09TzPOJQ.gif)\n\n* **Step over next function call**\nThis navigator allows you to step line-by-line, yet without stepping into function calls. That is, function calls will be stepped over and unless a breakpoint has been set within them, the debugger will not stop within statements in that function\n\n![Step over next function call](https://cdn-images-1.medium.com/max/4504/1*o8BEBvXjLJ2I5pATcWUWkw.gif)\n\nIf you pay attention to the image above, multiplyBy and renderToDOM were executed but the debugger did not step into them like the previous navigator did (**Step**).\n\n* **Step into next function call**\nSince Chrome 68, this navigator has changed its behavior. This is similar to *Step *which we have seen previously. The difference is that when stepping into asynchronous code, it will stop in the async code and not on the code that, chronologically, will run.\n\n![Step Into Next function call](https://cdn-images-1.medium.com/max/4504/1*hQVAtoo06qMSQDlUCd-1DQ.gif)\n\nWatch the image above: chronologically, line 32 should have been run, but it didn’t. The debugger waited and moved to line 29 after 2 seconds\n\n* **Step out of function call\n** Say you’re not interested in the execution of a certain function, this navigator allows you to step out of a function and will stop at the next line following the function call\n\n![Step Out of function call](https://cdn-images-1.medium.com/max/4508/1*bLRfIxnKbcz6-tikZi06Vw.gif)\n\nWhat happened in the image above?\n\n* We stopped at the breakpoint at line 36\n\n* We stepped out of the function renderToDOM\n\n* The debugger moved directly to line 29 and skipped the rest of the function renderToDOM\n\n### Global Variables and Eager Evaluation\n\nSometimes it can be useful to store in the global scope some values such as a component’s class, huge arrays or complex objects.\n\nAdding these values to the global scope while debugging can be a huge time-saver when you want to, for instance, call a method on that component with different parameters.\n\n![Setting a Global Variable from the current scope](https://cdn-images-1.medium.com/max/3964/1*datD6XsMhv__QA0eF2HjeA.gif)\n\nIn the image above, I save the array [previous, current] as a global variable. The Dev Tools automatically assign a name to the variable, which is temp{n} with n based on the number of previously saved variables.\n\nAs you can see in the image above, the variable gets named temp2 and I can use it in the console as it is now defined globally!\n\nThanks to **Eager Evaluation, **a feature ****released in Chrome 68, the Dev Tools allows the evaluation of statements in the console as you write them and also displays the signature of the method.\n\nIf you pay attention to the image above, when I map the saved variable to an array of strings, the result is immediately visible without me having to press Enter.\n\n## Navigating the Call Stack\n\nNavigating the call stack is one of the most useful tools that the Dev Tools provide: not only can you jump back and forth in the call stack, but you can also inspect the scope at each step.\n\nAssume we have a dead simple page and a script that takes in input a number and will render on the page the number multiplied by 10. We will call two functions: one to multiply, and one to render the result to the DOM.\n\n![Navigating through the Call Stack](https://cdn-images-1.medium.com/max/4328/1*SfNyMZRGB83s0lTWgEsk0A.gif)\n\nAs you can see in the image above, we are able to navigate through the call stack just by clicking on the name of the function in the pane “Call Stack”.\n\nAs you may have also noticed, every time we jump from a call to another, the scope is retained and we can analyze it at each step!\n\n### Blackbox scripts to flatten the stack\n\nBlackboxing scripts will help declutter the call stack by excluding from the stack certain scripts or scripts that match a certain pattern.\n\nFor instance, if I am solely interested in debugging the userland code, which is probably 99% of the times, I will add a pattern to black box all the scripts under the folder node_modules .\n\nIn order to black box a script, you have two ways:\n\n* right-click on a script in your Sources panel and click on “Blackbox Script”\n\n* go to the Chrome Settings page, then go to *Blackboxing *and click on *Add Pattern… *and enter the pattern you want to black box, which is useful when you want to exclude a large number of scripts\n\n![Blackboxing the node_modules folder](https://cdn-images-1.medium.com/max/3454/1*WgmPn7FqR0xFzdB9kPg1_Q.png)\n\n## Watch Expressions\n\nWatching expressions enable you to define some Javascript expressions that the Dev Tools will keep track of and execute, and will display the current result. This is a particularly interesting tool as you can virtually write anything you want, as long as it is a valid Javascript expression.\n\nFor example, you can write an expression and expect the result of this expression to always be true so that when the expression will be false , you know something is wrong in the current state.\n\nThere’s a catch:\n\n* while we’re debugging using breakpoints, the watch expressions will be evaluated live and won’t need to be refreshed\n\n* if the code is executing, you will need to manually click the refresh button\n\n![](https://cdn-images-1.medium.com/max/3344/1*vmDDbDAGSlmXnCP4zGg7GA.png)\n\n## Final Words\n\nThe Dev Tools are an incredible resource for debugging complex code. Sometimes you may dig deeper than console logging, and the tools above will allow for an in-depth debugging experience. These tools require a little practice before you’ll be fully comfortable using them, so don’t be put down if you’re feeling unfamiliar with all the options available.\n\n### Resources\n\nHere are some resources to fully understand all the available options the Dev Tools provide:\n\n* [Get Started with Debugging JavaScript in Chrome DevTools](https://developers.google.com/web/tools/chrome-devtools/javascript/)\n\n* [Console Overview](https://developers.google.com/web/tools/chrome-devtools/console/)","canonical":"https://blog.bitsrc.io/debugging-javascript-like-a-pro-a2e0f6c53c2e"},"content":{"compiledSource":"var c=Object.defineProperty,u=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var l=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var r=(t,a,n)=>a in t?c(t,a,{enumerable:!0,configurable:!0,writable:!0,value:n}):t[a]=n,e=(t,a)=>{for(var n in a||(a={}))l.call(a,n)&&r(t,n,a[n]);if(i)for(var n of i(a))s.call(a,n)&&r(t,n,a[n]);return t},p=(t,a)=>u(t,m(a));var h=(t,a)=>{var n={};for(var o in t)l.call(t,o)&&a.indexOf(o)<0&&(n[o]=t[o]);if(t!=null&&i)for(var o of i(t))a.indexOf(o)<0&&s.call(t,o)&&(n[o]=t[o]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var o=n,{components:t}=o,a=h(o,[\"components\"]);return mdx(MDXLayout,p(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"This post was originally published, by myself, on the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://blog.bitsrc.io\"}),\"Bit\"),\" blog\"),mdx(\"p\",null,\"Are you one of those who are console logging your way to a solution when your code is not behaving the way you expect? If yes, read on.\"),mdx(\"p\",null,\"This article aims to explain to you the most useful tools and techniques provided by the Chrome Dev Tools to debug your Javascript code \",mdx(\"strong\",{parentName:\"p\"},\"better and faster than ever before\"),\".\"),mdx(\"p\",null,\"By the end of this article, you\\u2019ll be able to debug your code better and faster than ever before.\"),mdx(\"p\",null,\"This is a summary of what we\\u2019re going to go through:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"setting breakpoints to debug code at a specific line\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"navigating the call stack\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"pausing/resuming the script execution\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"setting watch expressions\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"productivity tips and tricks for the Dev Tools\"))),mdx(\"h3\",null,\"Debugging Runtime Code\"),mdx(\"p\",null,\"If the cause you\\u2019re debugging your code is due to a bug or unexpected behavior, you\\u2019re likely interested in the \\u201CSources\\u201D tab in the Dev Tools, which is the section we\\u2019re going to explore in depth through a set of various scenarios.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/2886/1*o-K2FM8avaFY0MDonke7eQ.png\",alt:null}))),mdx(\"h2\",null,\"Breakpoints\"),mdx(\"p\",null,\"If you are reading this article, you probably are used to debugging a particular line by logging to the console a certain value. But I want you to introduce to a more powerful way that goes way deeper in the code than simply logging: \",mdx(\"strong\",{parentName:\"p\"},\"breakpoints\"),\".\"),mdx(\"p\",null,\"Setting breakpoints is normally the first step of the debugging process. The built-in development tools in most browsers allow you to stop the execution of your code at a particular line of code and at a particular statement on every line of code running on the page being debugged, but for the purpose of this article, we will be specifically using the Chrome Dev Tools.\"),mdx(\"h3\",null,\"What are Breakpoints for?\"),mdx(\"p\",null,\"Normally, you may want to stop the execution of the code so that you can interactively inspect the particular context that we\\u2019re interested in.\"),mdx(\"p\",null,\"Once the code has stopped at the breakpoint, we can start the debugging process by getting access to the scope, navigating the call stack, and even change the code at runtime.\"),mdx(\"h3\",null,\"How to set Breakpoints?\"),mdx(\"p\",null,\"In order to explain how to set breakpoints, we will debug an Angular codebase of one of the side projects I use for education purposes, although the technology used doesn\\u2019t really matter.\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"The first thing you may want to do is to open the dev tools and go to the \\u201CSources\\u201D tab\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},`Then, we need to open the file we want to debug\n`,mdx(\"strong\",{parentName:\"p\"},\"Tip: \"),\"on Mac, \\u2318 + O will open the files selector where you can find the file needed on the fly. On Windows, use CTRL+O\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Once the file has been opened, we can finally set up a breakpoint by clicking on the line of code we want to stop on.\"))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4316/1*HZnwrJpcjJQuBQuamXriIg.gif\",alt:\"Setting a Breakpoint\"}))),mdx(\"p\",null,\"As you can see in the image above, we can go deeper than setting a breakpoint on a line of code, and we can also set it to the statements on the same line of code.\"),mdx(\"p\",null,\"We set 3 breakpoints:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"the first on the line of code that stops the execution at definition time\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"the second will stop before the priceReceived function executes\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"the third one will stop right after priceReceived gets called, so we can also inspect the return value of the arrow function\"))),mdx(\"p\",null,\"When the arrow function gets called, the execution stops and the right-hand panel Scope gets populated with information regarding the current context, and gives us access to all the scope so we can inspect the values we\\u2019re interested in.\"),mdx(\"p\",null,\"In this case, you can see how we can see the value of the variable price.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4324/1*j56_-6hTF4z6pXWVC9TwnQ.png\",alt:\"Analyzing the current scope\"}))),mdx(\"p\",null,\"In the image below, our third breakpoint gets hit once the function priceReceived has been executed.\"),mdx(\"p\",null,\"As you can see in the right-hand panel, Return value will show us what the anonymous function returns\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4334/1*skx3u3zsEm3-VF338jG2Xw.png\",alt:\"Analyzing the Return Value of an anonymous function\"}))),mdx(\"h3\",null,\"Temporarily pausing Breakpoints\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Scenario\"),\": you set a bunch of breakpoints all over the codebase.\"),mdx(\"p\",null,\"As you may have experienced, it\\u2019s very common to refresh the page multiple times while debugging.\"),mdx(\"p\",null,\"The code you\\u2019re currently debugging may have various breakpoints and sometimes, these can even be called hundreds of times! Yeah, it can be frustrating and time-consuming.\"),mdx(\"p\",null,\"In such cases, I recommend to temporarily pause the execution of all breakpoints, and you can do this by toggling the icon you can see in the image below:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/3188/1*cnRKMhzmOptgjm0v6ey8-Q.gif\",alt:\"Deactivating all Breakpoints\"}))),mdx(\"h3\",null,\"Stopping Execution on Errors\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Scenario\"),\": you get an unexpected error, but you don\\u2019t want to set a breakpoint as you\\u2019re unsure when exactly the error is going to be thrown.\"),mdx(\"p\",null,\"You can stop the execution as soon as an error is thrown, so you can inspect the scope and understand what went wrong.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4780/1*6B4Uvz3g4sZpqlnUWDEBpw.gif\",alt:\"Pausing on Exceptions\"}))),mdx(\"h3\",null,\"Conditional Breakpoints\"),mdx(\"p\",null,\"Conditional Breakpoints, as the name suggests, allow us to only trigger certain breakpoints if a condition is truthy.\"),mdx(\"p\",null,\"For instance, in the example shown above, the user can input in the text area non-numerical values. JS is very forgiving and will just display NaN instead of throwing an error.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Scenario\"),\": you have more complex code than the one above, and can\\u2019t figure out when the result is NaN .\"),mdx(\"p\",null,\"Of course, you could set a breakpoint, but it\\u2019s not easy to reproduce the error and you end up spending half an hour stepping through the execution of your code. This is a scenario where you could use a conditional breakpoint and break the execution only when the value inspected is NaN .\"),mdx(\"p\",null,\"See the image below:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4504/1*e-pc-wpZexL8tknq9wunLg.gif\",alt:\"Conditional Breakpoint\"}))),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"We right-click on the line of code we want to add the breakpoint to\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Click on \\u201CAdd conditional breakpoint\\u2026\\u201D\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Add a valid JS expression. Of course, you have access to the scope when the expression gets called, which means we can reference the params x and y\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"When the expression is truthy, the breakpoint will be triggered!\"))),mdx(\"h3\",null,\"Stepping through your code\"),mdx(\"p\",null,\"In order to fully take advantage of the Dev Tools, it\\u2019s worth spending a little bit of time and learn how the Dev Tools helps us to quickly step through the code without setting breakpoints at each line.\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},`Step\n`),`The simplest navigator in the Dev Tools, allows you to step through your code line by line, based on execution order.\nIt\\u2019s important to notice that `,mdx(\"strong\",{parentName:\"li\"},\"Step \"),\"has been recently introduced due to a change to \",mdx(\"strong\",{parentName:\"li\"},\"Step Into next function call\"),\". When debugging asynchronous code, \",mdx(\"em\",{parentName:\"li\"},\"Step\"),\" will move to the next line chronologically\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4504/1*lnLSkTfTPgoZnH09TzPOJQ.gif\",alt:\"Step\"}))),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Step over next function call\"),`\nThis navigator allows you to step line-by-line, yet without stepping into function calls. That is, function calls will be stepped over and unless a breakpoint has been set within them, the debugger will not stop within statements in that function`)),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4504/1*o8BEBvXjLJ2I5pATcWUWkw.gif\",alt:\"Step over next function call\"}))),mdx(\"p\",null,\"If you pay attention to the image above, multiplyBy and renderToDOM were executed but the debugger did not step into them like the previous navigator did (\",mdx(\"strong\",{parentName:\"p\"},\"Step\"),\").\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Step into next function call\"),`\nSince Chrome 68, this navigator has changed its behavior. This is similar to `,mdx(\"em\",{parentName:\"li\"},\"Step \"),\"which we have seen previously. The difference is that when stepping into asynchronous code, it will stop in the async code and not on the code that, chronologically, will run.\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4504/1*hQVAtoo06qMSQDlUCd-1DQ.gif\",alt:\"Step Into Next function call\"}))),mdx(\"p\",null,\"Watch the image above: chronologically, line 32 should have been run, but it didn\\u2019t. The debugger waited and moved to line 29 after 2 seconds\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},`Step out of function call\n`),\" Say you\\u2019re not interested in the execution of a certain function, this navigator allows you to step out of a function and will stop at the next line following the function call\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4508/1*bLRfIxnKbcz6-tikZi06Vw.gif\",alt:\"Step Out of function call\"}))),mdx(\"p\",null,\"What happened in the image above?\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"We stopped at the breakpoint at line 36\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"We stepped out of the function renderToDOM\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"The debugger moved directly to line 29 and skipped the rest of the function renderToDOM\"))),mdx(\"h3\",null,\"Global Variables and Eager Evaluation\"),mdx(\"p\",null,\"Sometimes it can be useful to store in the global scope some values such as a component\\u2019s class, huge arrays or complex objects.\"),mdx(\"p\",null,\"Adding these values to the global scope while debugging can be a huge time-saver when you want to, for instance, call a method on that component with different parameters.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/3964/1*datD6XsMhv__QA0eF2HjeA.gif\",alt:\"Setting a Global Variable from the current scope\"}))),mdx(\"p\",null,\"In the image above, I save the array \",\"[previous, current]\",\" as a global variable. The Dev Tools automatically assign a name to the variable, which is temp{n} with n based on the number of previously saved variables.\"),mdx(\"p\",null,\"As you can see in the image above, the variable gets named temp2 and I can use it in the console as it is now defined globally!\"),mdx(\"p\",null,\"Thanks to \",mdx(\"strong\",{parentName:\"p\"},\"Eager Evaluation, \"),\"a feature ****released in Chrome 68, the Dev Tools allows the evaluation of statements in the console as you write them and also displays the signature of the method.\"),mdx(\"p\",null,\"If you pay attention to the image above, when I map the saved variable to an array of strings, the result is immediately visible without me having to press Enter.\"),mdx(\"h2\",null,\"Navigating the Call Stack\"),mdx(\"p\",null,\"Navigating the call stack is one of the most useful tools that the Dev Tools provide: not only can you jump back and forth in the call stack, but you can also inspect the scope at each step.\"),mdx(\"p\",null,\"Assume we have a dead simple page and a script that takes in input a number and will render on the page the number multiplied by 10. We will call two functions: one to multiply, and one to render the result to the DOM.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/4328/1*SfNyMZRGB83s0lTWgEsk0A.gif\",alt:\"Navigating through the Call Stack\"}))),mdx(\"p\",null,\"As you can see in the image above, we are able to navigate through the call stack just by clicking on the name of the function in the pane \\u201CCall Stack\\u201D.\"),mdx(\"p\",null,\"As you may have also noticed, every time we jump from a call to another, the scope is retained and we can analyze it at each step!\"),mdx(\"h3\",null,\"Blackbox scripts to flatten the stack\"),mdx(\"p\",null,\"Blackboxing scripts will help declutter the call stack by excluding from the stack certain scripts or scripts that match a certain pattern.\"),mdx(\"p\",null,\"For instance, if I am solely interested in debugging the userland code, which is probably 99% of the times, I will add a pattern to black box all the scripts under the folder node_modules .\"),mdx(\"p\",null,\"In order to black box a script, you have two ways:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"right-click on a script in your Sources panel and click on \\u201CBlackbox Script\\u201D\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"go to the Chrome Settings page, then go to \",mdx(\"em\",{parentName:\"p\"},\"Blackboxing \"),\"and click on \",mdx(\"em\",{parentName:\"p\"},\"Add Pattern\\u2026 \"),\"and enter the pattern you want to black box, which is useful when you want to exclude a large number of scripts\"))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/3454/1*WgmPn7FqR0xFzdB9kPg1_Q.png\",alt:\"Blackboxing the node_modules folder\"}))),mdx(\"h2\",null,\"Watch Expressions\"),mdx(\"p\",null,\"Watching expressions enable you to define some Javascript expressions that the Dev Tools will keep track of and execute, and will display the current result. This is a particularly interesting tool as you can virtually write anything you want, as long as it is a valid Javascript expression.\"),mdx(\"p\",null,\"For example, you can write an expression and expect the result of this expression to always be true so that when the expression will be false , you know something is wrong in the current state.\"),mdx(\"p\",null,\"There\\u2019s a catch:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"while we\\u2019re debugging using breakpoints, the watch expressions will be evaluated live and won\\u2019t need to be refreshed\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"if the code is executing, you will need to manually click the refresh button\"))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/3344/1*vmDDbDAGSlmXnCP4zGg7GA.png\",alt:null}))),mdx(\"h2\",null,\"Final Words\"),mdx(\"p\",null,\"The Dev Tools are an incredible resource for debugging complex code. Sometimes you may dig deeper than console logging, and the tools above will allow for an in-depth debugging experience. These tools require a little practice before you\\u2019ll be fully comfortable using them, so don\\u2019t be put down if you\\u2019re feeling unfamiliar with all the options available.\"),mdx(\"h3\",null,\"Resources\"),mdx(\"p\",null,\"Here are some resources to fully understand all the available options the Dev Tools provide:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://developers.google.com/web/tools/chrome-devtools/javascript/\"}),\"Get Started with Debugging JavaScript in Chrome DevTools\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://developers.google.com/web/tools/chrome-devtools/console/\"}),\"Console Overview\")))))}MDXContent.isMDXComponent=!0;\n","scope":{}},"series":[],"morePosts":[],"moreArticles":[],"type":1},"__N_SSG":true}