{"pageProps":{"post":{"live":true,"readingTime":"8 min read","title":"Soft Skills for Software Developers","date":"2019-08-29T00:00:00.000Z","slug":"soft-skills-for-software-developers","coverImage":"https://cdn-images-1.medium.com/max/10804/0*wTGN7rJftHUpYft0","collection":"thoughts","excerpt":"A write-down of my thoughts about being a good teammate, and what I wish every single one of my future colleagues would know","content":"\nThis post was originally published, by myself, on the [Bit](https://blog.bitsrc.io) blog\n\nIn my career, I have had the pleasure to work for several years with teams from different parts of the world, each with different ways, cultures, and experiences. Of course, there have been highs and lows, both from a personal and technical point of views.\n\nThis makes me often reflect on how the soft-skills capacity of each team affected not only the technical results but also the personal wellness and job satisfaction. That is why I strive every day to improve and reflect upon my own soft-skills and to share with others my thoughts and my advice.\n\nThis article is ultimately a write-down of my thoughts about being a good teammate, and what I wish every single one of my future colleagues would know.\n\n## Before we start: what are Soft Skills?\n\nSoft Skills are a mix of communication, emotional, social and people skills that enable us to work well with other people.\n\nThese are often overlooked, and yet, a crucial set of skills in the software development world that in my opinion, every software developer should understand and try to develop the beginning of their careers.\n\nSure, writing good code is important, but I tend to place hard skills and soft skills on the same level of importance for every programmer. In my opinion, a great programmer (or the infamous 10x engineer) also needs to be a great teammate. The two things go hand-in-hand.\n\nIf you’re about to embark on your first programming job, or even if you’re a veteran already, read on and reflect on the points below.\n> # A great programmer (or the infamous 10x engineer) also needs to be a great teammate. The two things go hand-in-hand\n\n## Develop Empathy\n\nEmpathy is the ability to understand the feeling of another person. To momentarily imagine yourself as another being, and try to think what’s it like to be that person. This is, in my opinion, the foundation of every interaction.\n\nAs developers who have to collaborate with numerous people, some of which you may like or not like, our empathy is challenged multiple times daily, in a variety of situations, such as:\n\n* when pairing and reviewing\n\n* when gathering requirements\n\n* when debugging someone else’s code\n\n* when leading other programmers\n\n### The importance of Language\n\nLanguage and communication have a huge impact in our every-day lives: too many times, I notice that people come off as condescending or brush due to culture and language-related skills rather than their lack of empathy; especially for some people who have not mastered 100% a certain language, they are often more easily misunderstood than native-language speakers.\n\nDue to the diversity of the teams I work in, situations like these happen daily; it’s not easy not to get frustrated sometimes. When a person speaks another language, you’re faced with two issues: words-choice, and cultural aspects.\n\nWords-choice can, of course, be driven from cultural aspects: for example, in English (and especially in the UK) we often use “sorry”, “thank you”, and “please” in our sentences.\n\nOf course, we expect the other person to be knowing this and to be using the same words when due. But what if our interlocutor’s language does not make use of these words as often (or at all!)?\n\nI am myself not a native-English speaker, which is the reason why I can relate with other people in this sort of situations: I’m empathetic towards them.\n\nIn short, that’s why it is so useful for programmers to be empathetic. It’s a skill that we need to use all day, every day, even if we don’t really know that.\n\n## Listen, then talk\n\nThis is probably common sense that is universally valid, but it needs to be listed. As developers, after all, we strive to be efficient in every aspect of our lives.\n\nInterrupting your colleagues is one of the most common behaviors I see during meetings. That’s a sure way to frustrate your colleagues, in case you were wondering.\n\nListening first and carefully is incredibly important, and not only a for a matter of respect, even when you are disagreeing on every single word. You may think it’s a waste of time, and yet it’s the right thing to do.\n> # Listen carefully, then talk\n\n## Teach, but also learn at the same time\n\nIt is very easy to come off as condescending when you are trying to make your point, explain something, or while mentoring someone else.\n\nCommunication is extremely hard, so you should expect this to happen even when you totally did not mean it.\n\nThere are ways we can try to avoid sounding condescending while discussing:\n\n* of course, choosing carefully your words is important, and my advice is to be as neutral as possible: for example, rather than “a bad approach”, I would say it is “not optimal” or that “it could be better”\n\n* stop commanding, start advising instead: instead of saying “you should do it that way”, you can say “my advice would be to do it that way”\n\n* stop only talking about your point of view; ask questions regularly and check your interlocutor’s view about what you’re discussing\n\n* stop assuming you know everything about the subject\n> # Communication is extremely hard, so you should expect this to happen even when you totally did not mean it\n\n## Accept criticism & Be open to change\n\nOurs is a creative industry.\n\nTo us, our code is art, the same way a painting is to an artist or a song to a songwriter.\n\nBeing developers means being judged every day, in a way or another. As we tend to identify personally with our outputs, **we take any judgment to our code, our ideas, and our views extremely at heart**.\n\nOne of the hardest parts of our jobs is accepting criticism from others, be it during interviews, meetings, PR reviews, etc.\n\nI don’t think I have nailed this one yet myself, but I surely improved drastically since my first years as a professional.\n\nWe spend years crafting our skills in a particular technology, and as time passes, we become accustomed to our ways of doing things, or to the ways of our team. As a result, **we become increasingly resistant to changes**, especially when they’re brought in from a third party.\n\nRemember that new guy who wanted to start refactoring the whole codebase? Or the one who wanted to introduce Go and replace your Java stack? I’m sure we all, at some point, lived such situations: I don’t know you, but to me, they (irrationally) felt these as personal attacks.\n\nUnderstandably, **developers hate change**.\n\nIf you haven’t noticed, this goes both ways:\n\n* the new hire likes the architecture at his previous company and is impatient to rewrite everything the way he’s used to, cause he’s 100% sure it’s better\n\n* the team, instead, is used to the way they have written their codebase (or to the way they inherited it) and have no intention to let the new hire change everything\n\nOf course, this is a generic scenario (very common, though), and any of the parties may be right. Maybe the current architecture really is bad and needs refactoring, and maybe the guy is just being very opinionated.\n\nThe point is that if you instantly feel attacked when someone else brings up the eventuality to change something, then **the problem is with you**, rather than with the idea itself. You’re **irrationally getting defensive **against a new approach before evening fully understanding it.\n\nI think this happens to me all the time. It’s how I am, and how many others are. How do I make sure I don’t combat the idea because of me?\n\n* I listen carefully to it\n\n* I ask my colleague to give me some time to make some research and think about it\n\n* I get back with my honest thoughts\n> # If you instantly feel attacked when someone else brings up the eventuality to change something, then **the problem is with you**, rather than with the idea itself.\n\n## General Advice\n\n* If you think a colleague did a good job, don’t hold back and compliment them genuinely\n\n* Give credit to others when due\n\n* Be as transparent as possible: talk to your colleagues about clarifications, changes, and opinions. For example — sneaking in commits when someone is out-of-office is not a nice way to refactor someone else’s code. Talking and thinking about it together openly is\n\n* Sometimes conflicts will happen if you did nothing wrong and followed all the possible advice; remember that this is absolutely normal, we can’t control everything. Companies and humans are complex, and this is simply a simplification of what actually happens every day\n\n## Takeaways\n\nOf course, this is a personal opinion of mine about what makes a good team-mate and how a well-rounded software engineer should behave with colleagues and in the workplace. These are not scientific aspects — just my view based on my experience.\n\nIn summary, here are some of the aspects that I would want to see in someone as my next colleague:\n\n* Being empathy makes you a better person but especially a better colleague\n\n* Try to understand the other’s point of view, taking into account culture, language, and how their social norms can differ from yours\n\n* Stop dismissing other people’s opinions before hearing their’s full argument\n\n* Try not to be condescending in situations where misunderstandings and conflicts are easy to arise\n\n* Try to be more open to criticism and change, and understand when you’re irrationally getting defensive for your opinions\n\n* Sometimes bad situations will happen even if did everything correctly from your point of view; don’t get discouraged, it is normal and these will serve as experience for your long career\n","canonical":"https://blog.bitsrc.io/soft-skills-for-software-developers-ae1a7956615e"},"content":{"compiledSource":"var u=Object.defineProperty,m=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(e,t,a)=>t in e?u(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,i=(e,t)=>{for(var a in t||(t={}))r.call(t,a)&&l(e,a,t[a]);if(n)for(var a of n(t))s.call(t,a)&&l(e,a,t[a]);return e},p=(e,t)=>m(e,d(t));var h=(e,t)=>{var a={};for(var o in e)r.call(e,o)&&t.indexOf(o)<0&&(a[o]=e[o]);if(e!=null&&n)for(var o of n(e))t.indexOf(o)<0&&s.call(e,o)&&(a[o]=e[o]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var o=a,{components:e}=o,t=h(o,[\"components\"]);return mdx(MDXLayout,p(i(i({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"This post was originally published, by myself, on the \",mdx(\"a\",i({parentName:\"p\"},{href:\"https://blog.bitsrc.io\"}),\"Bit\"),\" blog\"),mdx(\"p\",null,\"In my career, I have had the pleasure to work for several years with teams from different parts of the world, each with different ways, cultures, and experiences. Of course, there have been highs and lows, both from a personal and technical point of views.\"),mdx(\"p\",null,\"This makes me often reflect on how the soft-skills capacity of each team affected not only the technical results but also the personal wellness and job satisfaction. That is why I strive every day to improve and reflect upon my own soft-skills and to share with others my thoughts and my advice.\"),mdx(\"p\",null,\"This article is ultimately a write-down of my thoughts about being a good teammate, and what I wish every single one of my future colleagues would know.\"),mdx(\"h2\",null,\"Before we start: what are Soft Skills?\"),mdx(\"p\",null,\"Soft Skills are a mix of communication, emotional, social and people skills that enable us to work well with other people.\"),mdx(\"p\",null,\"These are often overlooked, and yet, a crucial set of skills in the software development world that in my opinion, every software developer should understand and try to develop the beginning of their careers.\"),mdx(\"p\",null,\"Sure, writing good code is important, but I tend to place hard skills and soft skills on the same level of importance for every programmer. In my opinion, a great programmer (or the infamous 10x engineer) also needs to be a great teammate. The two things go hand-in-hand.\"),mdx(\"p\",null,\"If you\\u2019re about to embark on your first programming job, or even if you\\u2019re a veteran already, read on and reflect on the points below.\"),mdx(\"blockquote\",null,mdx(\"h1\",{parentName:\"blockquote\"},\"A great programmer (or the infamous 10x engineer) also needs to be a great teammate. The two things go hand-in-hand\")),mdx(\"h2\",null,\"Develop Empathy\"),mdx(\"p\",null,\"Empathy is the ability to understand the feeling of another person. To momentarily imagine yourself as another being, and try to think what\\u2019s it like to be that person. This is, in my opinion, the foundation of every interaction.\"),mdx(\"p\",null,\"As developers who have to collaborate with numerous people, some of which you may like or not like, our empathy is challenged multiple times daily, in a variety of situations, such as:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"when pairing and reviewing\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"when gathering requirements\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"when debugging someone else\\u2019s code\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"when leading other programmers\"))),mdx(\"h3\",null,\"The importance of Language\"),mdx(\"p\",null,\"Language and communication have a huge impact in our every-day lives: too many times, I notice that people come off as condescending or brush due to culture and language-related skills rather than their lack of empathy; especially for some people who have not mastered 100% a certain language, they are often more easily misunderstood than native-language speakers.\"),mdx(\"p\",null,\"Due to the diversity of the teams I work in, situations like these happen daily; it\\u2019s not easy not to get frustrated sometimes. When a person speaks another language, you\\u2019re faced with two issues: words-choice, and cultural aspects.\"),mdx(\"p\",null,\"Words-choice can, of course, be driven from cultural aspects: for example, in English (and especially in the UK) we often use \\u201Csorry\\u201D, \\u201Cthank you\\u201D, and \\u201Cplease\\u201D in our sentences.\"),mdx(\"p\",null,\"Of course, we expect the other person to be knowing this and to be using the same words when due. But what if our interlocutor\\u2019s language does not make use of these words as often (or at all!)?\"),mdx(\"p\",null,\"I am myself not a native-English speaker, which is the reason why I can relate with other people in this sort of situations: I\\u2019m empathetic towards them.\"),mdx(\"p\",null,\"In short, that\\u2019s why it is so useful for programmers to be empathetic. It\\u2019s a skill that we need to use all day, every day, even if we don\\u2019t really know that.\"),mdx(\"h2\",null,\"Listen, then talk\"),mdx(\"p\",null,\"This is probably common sense that is universally valid, but it needs to be listed. As developers, after all, we strive to be efficient in every aspect of our lives.\"),mdx(\"p\",null,\"Interrupting your colleagues is one of the most common behaviors I see during meetings. That\\u2019s a sure way to frustrate your colleagues, in case you were wondering.\"),mdx(\"p\",null,\"Listening first and carefully is incredibly important, and not only a for a matter of respect, even when you are disagreeing on every single word. You may think it\\u2019s a waste of time, and yet it\\u2019s the right thing to do.\"),mdx(\"blockquote\",null,mdx(\"h1\",{parentName:\"blockquote\"},\"Listen carefully, then talk\")),mdx(\"h2\",null,\"Teach, but also learn at the same time\"),mdx(\"p\",null,\"It is very easy to come off as condescending when you are trying to make your point, explain something, or while mentoring someone else.\"),mdx(\"p\",null,\"Communication is extremely hard, so you should expect this to happen even when you totally did not mean it.\"),mdx(\"p\",null,\"There are ways we can try to avoid sounding condescending while discussing:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"of course, choosing carefully your words is important, and my advice is to be as neutral as possible: for example, rather than \\u201Ca bad approach\\u201D, I would say it is \\u201Cnot optimal\\u201D or that \\u201Cit could be better\\u201D\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"stop commanding, start advising instead: instead of saying \\u201Cyou should do it that way\\u201D, you can say \\u201Cmy advice would be to do it that way\\u201D\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"stop only talking about your point of view; ask questions regularly and check your interlocutor\\u2019s view about what you\\u2019re discussing\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"stop assuming you know everything about the subject\"),mdx(\"blockquote\",{parentName:\"li\"},mdx(\"h1\",{parentName:\"blockquote\"},\"Communication is extremely hard, so you should expect this to happen even when you totally did not mean it\")))),mdx(\"h2\",null,\"Accept criticism & Be open to change\"),mdx(\"p\",null,\"Ours is a creative industry.\"),mdx(\"p\",null,\"To us, our code is art, the same way a painting is to an artist or a song to a songwriter.\"),mdx(\"p\",null,\"Being developers means being judged every day, in a way or another. As we tend to identify personally with our outputs, \",mdx(\"strong\",{parentName:\"p\"},\"we take any judgment to our code, our ideas, and our views extremely at heart\"),\".\"),mdx(\"p\",null,\"One of the hardest parts of our jobs is accepting criticism from others, be it during interviews, meetings, PR reviews, etc.\"),mdx(\"p\",null,\"I don\\u2019t think I have nailed this one yet myself, but I surely improved drastically since my first years as a professional.\"),mdx(\"p\",null,\"We spend years crafting our skills in a particular technology, and as time passes, we become accustomed to our ways of doing things, or to the ways of our team. As a result, \",mdx(\"strong\",{parentName:\"p\"},\"we become increasingly resistant to changes\"),\", especially when they\\u2019re brought in from a third party.\"),mdx(\"p\",null,\"Remember that new guy who wanted to start refactoring the whole codebase? Or the one who wanted to introduce Go and replace your Java stack? I\\u2019m sure we all, at some point, lived such situations: I don\\u2019t know you, but to me, they (irrationally) felt these as personal attacks.\"),mdx(\"p\",null,\"Understandably, \",mdx(\"strong\",{parentName:\"p\"},\"developers hate change\"),\".\"),mdx(\"p\",null,\"If you haven\\u2019t noticed, this goes both ways:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"the new hire likes the architecture at his previous company and is impatient to rewrite everything the way he\\u2019s used to, cause he\\u2019s 100% sure it\\u2019s better\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"the team, instead, is used to the way they have written their codebase (or to the way they inherited it) and have no intention to let the new hire change everything\"))),mdx(\"p\",null,\"Of course, this is a generic scenario (very common, though), and any of the parties may be right. Maybe the current architecture really is bad and needs refactoring, and maybe the guy is just being very opinionated.\"),mdx(\"p\",null,\"The point is that if you instantly feel attacked when someone else brings up the eventuality to change something, then \",mdx(\"strong\",{parentName:\"p\"},\"the problem is with you\"),\", rather than with the idea itself. You\\u2019re \",mdx(\"strong\",{parentName:\"p\"},\"irrationally getting defensive \"),\"against a new approach before evening fully understanding it.\"),mdx(\"p\",null,\"I think this happens to me all the time. It\\u2019s how I am, and how many others are. How do I make sure I don\\u2019t combat the idea because of me?\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"I listen carefully to it\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"I ask my colleague to give me some time to make some research and think about it\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"I get back with my honest thoughts\"),mdx(\"blockquote\",{parentName:\"li\"},mdx(\"h1\",{parentName:\"blockquote\"},\"If you instantly feel attacked when someone else brings up the eventuality to change something, then \",mdx(\"strong\",{parentName:\"h1\"},\"the problem is with you\"),\", rather than with the idea itself.\")))),mdx(\"h2\",null,\"General Advice\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"If you think a colleague did a good job, don\\u2019t hold back and compliment them genuinely\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Give credit to others when due\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Be as transparent as possible: talk to your colleagues about clarifications, changes, and opinions. For example \\u2014 sneaking in commits when someone is out-of-office is not a nice way to refactor someone else\\u2019s code. Talking and thinking about it together openly is\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Sometimes conflicts will happen if you did nothing wrong and followed all the possible advice; remember that this is absolutely normal, we can\\u2019t control everything. Companies and humans are complex, and this is simply a simplification of what actually happens every day\"))),mdx(\"h2\",null,\"Takeaways\"),mdx(\"p\",null,\"Of course, this is a personal opinion of mine about what makes a good team-mate and how a well-rounded software engineer should behave with colleagues and in the workplace. These are not scientific aspects \\u2014 just my view based on my experience.\"),mdx(\"p\",null,\"In summary, here are some of the aspects that I would want to see in someone as my next colleague:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Being empathy makes you a better person but especially a better colleague\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Try to understand the other\\u2019s point of view, taking into account culture, language, and how their social norms can differ from yours\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Stop dismissing other people\\u2019s opinions before hearing their\\u2019s full argument\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Try not to be condescending in situations where misunderstandings and conflicts are easy to arise\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Try to be more open to criticism and change, and understand when you\\u2019re irrationally getting defensive for your opinions\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Sometimes bad situations will happen even if did everything correctly from your point of view; don\\u2019t get discouraged, it is normal and these will serve as experience for your long career\"))))}MDXContent.isMDXComponent=!0;\n","scope":{}},"series":[],"morePosts":[],"moreArticles":[{"live":true,"readingTime":"3 min read","title":"Frameworks don't magically make your code good","date":"2019-04-27T00:00:00.322Z","slug":"frameworks-dont-magically-make-your-code-good","coverImage":"/assets/images/posts/frameworks-do-not-magically-make-code-better.jpeg","collection":"thoughts","excerpt":"Why using the latest cool stacks doesn’t (always) mean you’re going to write better code","tags":["programming"]}],"type":1},"__N_SSG":true}