{"pageProps":{"post":{"readingTime":"3 min read","live":true,"title":"Frameworks don't magically make your code good","date":"2019-04-27T00:00:00.322Z","slug":"frameworks-dont-magically-make-your-code-good","content":"<p>Since the beginning of this decade, Front End web frameworks have dramatically changed the way we build applications, with both pros and cons.</p>\n<p>Since the time I read the todos example on the old Angular website, I have been ever since a huge fan, as you may know if you read some of my previous articles.</p>\n<p>I loved everything about it: custom elements, routing, services, pipes/filters, and so on. Everything started to be more fun to work with and made more and more sense.</p>\n<p>And the more I loved these tools, the more elitist I became. And looking back, I am certainly not proud of myself.</p>\n<p>While I feel I got past these feelings in the last few years, I can see the same thing happening every day at places where I have worked, and obviously to an even greater extent online on websites such as Github, Reddit, chats, etc.</p>\n<h3>Tech elitism is bad</h3>\n<p>It really is.</p>\n<p>What do I mean by that? To me, Tech elitism is the feeling of an individual to look down on stacks he <strong>doesn’t know or doesn’t like</strong> and <strong>basing their opinion on that and only that</strong>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*w2kxwb78swTjKy6ffVVxLQ.jpeg\" alt=\"\"></p>\n<p>Type caption for image (optional)</p>\n<p>A <em>tech elitist</em> will:</p>\n<ul>\n<li>laugh at you for using Angular instead of Vue, or for using React instead of Inferno (or vice-versa). </li>\n<li>judge your choice for (still!) testing with Jasmine rather than Jest, Protractor instead of Cypress</li>\n<li>complain about you using semicolons (shame!)</li>\n<li>… generally, look you down as a developer without knowing what code you work with and what your product does</li>\n</ul>\n<h3>… but web frameworks are great, right?</h3>\n<p>Yeah! As I said, I’m a huge fan too. </p>\n<p>Despite the controversial <a href=\"https://medium.com/@ericclemmons/javascript-fatigue-48d4011b6fc4\">Javascript Fatigue</a>, it’s undeniable that the newest tooling available brings awesome features and functionalities that we love. </p>\n<p>Yes, frameworks provide:</p>\n<ul>\n<li>tooling for reusing code like never before</li>\n<li>better testing options</li>\n<li>a vast amount of third-party libraries</li>\n</ul>\n<p>But… it’s important to remember that <strong>frameworks provide only a part</strong> of the many lines of code that make up a project.</p>\n<p>I have seen React projects coded way worse than some using jQuery. Or Angular 1.x projects written way better than others using the latest Angular.</p>\n<p>Why? </p>\n<p>That’s probably because the developers who wrote the project were just not as good at architecting and designing large, complex codebases. </p>\n<p>They weren’t using:</p>\n<ul>\n<li>design patterns</li>\n<li>tests, of any sort</li>\n<li>code reviews</li>\n<li>… just basic software engineering practices</li>\n</ul>\n<p>That, <strong>frameworks cannot teach you</strong>. They help a lot, they provide guidance, and examples, but only so much. Large-scale projects need more thinking than that — and it’s not an easy task.</p>\n<p>Some of us think that by just using the latest piece of tech, we are spared from thinking, and architecting, and designing every keystroke. But, as it turns out, that’s wrong.</p>\n<h3>What are the things that really matter?</h3>\n<p>I am not ashamed to say that I would not pick up an old project nowadays if I wasn’t sure that a plan was in place to move forward with newer technologies.</p>\n<p>But other than the stack used at a company, I nowadays have a larger set of questions for prospective employees or people I meet networking:</p>\n<ul>\n<li>do you write tests? unit, functional, end-to-end tests? how important is that to you?</li>\n<li>what design patterns do you use? [please don’t say you use none, PLEASE]</li>\n<li>what’s your pipeline like?</li>\n<li>how do you do Agile?</li>\n<li>how much legacy code do you have? what plan is in place to fix that?</li>\n<li>do you contribute to open source at all?</li>\n<li>what are code reviews like?</li>\n<li>what’s the business strategy?</li>\n</ul>\n<p><strong>Is your cool stack accompanied by decent software engineering practices?</strong></p>\n<p><strong>Do you care at all about it?</strong></p>\n","ogImage":{"url":"https://miro.medium.com/max/1400/1*jBgcK5sLhAdi6x85PKl02w.jpeg"},"coverImage":"https://miro.medium.com/max/1400/1*jBgcK5sLhAdi6x85PKl02w.jpeg","collection":"thoughts"},"morePosts":[]},"__N_SSG":true}